app/views/events/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "events" INNER JOIN "attendees" ON "events"."id" = "attendees"."event_id" WHERE "attendees"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 5], ["LIMIT", 1]]
---
      <li><%= link_to event.name, event %>
        <% if User.find(1).events.include? event %>