app/views/events/index.html.erb

          <h3>My Events</h3>
          <% @user.my_events.each do |event| %>
---
SELECT "events".* FROM "events"