app/views/events/show.html.erb

SELECT "attendees".* FROM "attendees" WHERE "attendees"."event_id" = $1  [["event_id", 5]]
---
        <ul>
          <% @event.attendees.each do |attendee|%>