app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @events = Event.all
    @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @event = Event.new
    @user = User.find(session[:user_id])

INSERT INTO "attendees" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["event_id", 3], ["created_at", "2018-08-01 16:57:02.317584"], ["updated_at", "2018-08-01 16:57:02.317584"]]
---
  def attend
    attendee = Attendee.create(attendee_params)

SELECT  "attendees".* FROM "attendees" WHERE "attendees"."user_id" = $1 AND "attendees"."event_id" = $2 LIMIT $3  [["user_id", 4], ["event_id", 5], ["LIMIT", 1]]
DELETE FROM "attendees" WHERE "attendees"."id" = $1  [["id", 16]]
---
  def unattend
    attendee = Attendee.find_by(user_id: attendee_params[:user_id], event_id: attendee_params[:event_id])
    if attendee != nil
      attendee.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @user = User.find(session[:user_id])
    @event = Event.find(params[:id])