app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def created_events
    Event.where("owner_id = #{self.id}")